[
  {
    "content": {
      "en": "Use `cortex search` with natural language — it understands semantic meaning, not just keywords.",
      "es": "Usa `cortex search` con lenguaje natural; entiende el significado semántico, no solo palabras clave."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "CORTEX stores facts with temporal validity. Use `valid_from` and `valid_until` to time-scope knowledge.",
      "es": "CORTEX guarda hechos con validez temporal. Usa `valid_from` y `valid_until` para acotar el conocimiento en el tiempo."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "`cortex recall <project>` loads full project context instantly — perfect for resuming work.",
      "es": "`cortex recall <project>` carga el contexto completo del proyecto al instante: ideal para retomar el trabajo."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "The consensus system lets multiple agents vote on facts. Higher consensus = more trustworthy.",
      "es": "El sistema de consenso permite que varios agentes voten hechos. A mayor consenso, mayor confiabilidad."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "CORTEX auto-generates embeddings for every fact. Semantic search works out of the box.",
      "es": "CORTEX genera embeddings para cada hecho automáticamente. La búsqueda semántica funciona de serie."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "The episodic memory system records entire conversation sessions — like a persistent brain.",
      "es": "El sistema de memoria episódica registra sesiones enteras de conversación, como un cerebro persistente."
    },
    "category": "cortex"
  },
  {
    "content": {
      "en": "Store decisions immediately after making them. Memory is cheaper than reconstruction.",
      "es": "Guarda las decisiones inmediatamente después de tomarlas. La memoria es más barata que la reconstrucción."
    },
    "category": "workflow"
  },
  {
    "content": {
      "en": "Tag facts with confidence levels: C5 (confirmed) → C1 (hypothesis). Filter by certainty later.",
      "es": "Etiqueta hechos con niveles de confianza: C5 (confirmado) → C1 (hipótesis). Filtra por certeza después."
    },
    "category": "workflow"
  },
  {
    "content": {
      "en": "Ghosts are unfinished work items. Use `cortex ghost list` to track what needs attention.",
      "es": "Los 'ghosts' son tareas inacabadas. Usa `cortex ghost list` para saber qué necesita atención."
    },
    "category": "workflow"
  },
  {
    "content": {
      "en": "The MEJORAlo score should be > 70 before shipping. Run `/mejoralo` on any file to check.",
      "es": "La puntuación MEJORAlo debería ser > 70 antes de publicar. Ejecuta `/mejoralo` en cualquier archivo."
    },
    "category": "workflow"
  },
  {
    "content": {
      "en": "SQLite WAL mode is enabled by default. This gives you concurrent reads during writes.",
      "es": "El modo WAL de SQLite está activo por defecto. Permite lecturas concurrentes durante las escrituras."
    },
    "category": "performance"
  },
  {
    "content": {
      "en": "The compactor merges redundant facts to keep the database lean. Run `cortex compact` periodically.",
      "es": "El compactador fusiona hechos redundantes para mantener la BD ligera. Ejecuta `cortex compact` a menudo."
    },
    "category": "performance"
  },
  {
    "content": {
      "en": "Never hardcode API keys. CORTEX loads all secrets from environment variables.",
      "es": "Nunca pongas claves API a fuego. CORTEX carga todos los secretos desde variables de entorno."
    },
    "category": "security"
  },
  {
    "content": {
      "en": "The crypto vault encrypts sensitive facts at rest using AES-GCM.",
      "es": "La bóveda criptográfica encripta hechos sensibles en reposo usando AES-GCM."
    },
    "category": "security"
  },
  {
    "content": {
      "en": "Use `ruff` for linting — it's 10-100x faster than flake8 and covers more rules.",
      "es": "Usa `ruff` para el linter: es 10-100 veces más rápido que flake8 y cubre más reglas."
    },
    "category": "python"
  },
  {
    "content": {
      "en": "Industrial Noir: #0A0A0A backgrounds, #CCFF00 accents, glassmorphism panels. The MOSKV aesthetic.",
      "es": "Industrial Noir: fondos #0A0A0A, acentos #CCFF00, paneles glassmorphism. La estética MOSKV."
    },
    "category": "design"
  },
  {
    "content": {
      "en": "CORTEX persists 3 types at session close: decisions, errors, and ghosts. Never lose context.",
      "es": "CORTEX guarda 3 tipos al cerrar: decisiones, errores y 'ghosts'. No pierdas el contexto."
    },
    "category": "memory"
  },
  {
    "content": {
      "en": "The 130/100 standard: meeting requirements is 100. Anticipating needs you didn't know you had is 130.",
      "es": "El estándar 130/100: cumplir requisitos es 100. Anticipar necesidades que no sabías que tenías es 130."
    },
    "category": "meta"
  },
  {
    "content": {
      "en": "Every element must answer 'Why?'. If it has no purpose, delete it.",
      "es": "Cada elemento debe responder a '¿Por qué?'. Si no tiene propósito, bórralo."
    },
    "category": "meta"
  }
]
